#include <iostream>
#include <mpi.h>

// Link: https://interview.cups.online/live-coding/?room=1d57eb84-2429-4e16-b0ad-e0fc3809297b

/**
 Задание:
    На процессе с рангом 0 сгенерировать массив из 100 элементов,
    разбить на равные куски массив и переслать другим процессам.
    Посчитать частичные суммы на каждом процессе, вывести получившиеся
    значения и отправить обратно нулевому. На нулевом посчитать полную
    сумму и также вывести.
 */

int main(int argc, char *argv[]) {

    return 0;
}
